#использовать "../src"
#Использовать asserts
#Использовать logos

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ПроверитьПомещениеИПолучениеИзКонтекст");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьДобавлениеВКонтекст");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПолучениеЗначенийИзКонтекста");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПолучениеСтруктурыКонтекста");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьУдалениеИзКонтекста");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьОчисткуКонтекста");	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПолучениеИУстановкаКонтекста");	
	
	Возврат ИменаТестов;

КонецФункции

#Область Реализованные_тесты

Процедура ТестДолжен_ПроверитьПомещениеИПолучениеИзКонтекст() Экспорт

	Контекст = Новый Контекст();
	Контекст.В_("Ключ1", "ЗначениеКлюча");

	Ожидаем.Что(Контекст.Из_("Ключ1"), "Значения контекста должны быть равны").Равно("ЗначениеКлюча");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьДобавлениеВКонтекст() Экспорт
	
	Значение1 = "Знач1";
	Значение2 = "Знач2";
	Значение3 = "Знач3";

	Контекст = Новый Контекст();
	Контекст.Добавить("Ключ1, Ключ2, Ключ3", Значение1, Значение2, Значение3);


	Ожидаем.Что(Контекст.Из_("Ключ1"), "Значения контекста должны быть равны").Равно(Значение1);
	Ожидаем.Что(Контекст.Из_("Ключ2"), "Значения контекста должны быть равны").Равно(Значение2);
	Ожидаем.Что(Контекст.Из_("Ключ3"), "Значения контекста должны быть равны").Равно(Значение3);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьПолучениеЗначенийИзКонтекста() Экспорт
	
	Значение1 = "Знач1";
	Значение2 = "Знач2";
	Значение3 = "Знач3";

	Контекст = Новый Контекст();
	Контекст.Добавить("Ключ1, Ключ2, Ключ3", Значение1, Значение2, Значение3);


	МассивЗначений = Контекст.ПолучитьЗначения("Ключ1, Ключ2, Ключ3");

	Ожидаем.Что(МассивЗначений[0], "Значения контекста должны быть равны").Равно(Значение1);
	Ожидаем.Что(МассивЗначений[1], "Значения контекста должны быть равны").Равно(Значение2);
	Ожидаем.Что(МассивЗначений[2], "Значения контекста должны быть равны").Равно(Значение3);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьПолучениеСтруктурыКонтекста() Экспорт
	
	Значение1 = "Знач1";
	Значение2 = "Знач2";
	Значение3 = "Знач3";

	СтруктураИЗ = Новый Структура("Ключ1, Ключ2, Ключ3", Значение1, Значение2, Значение3);

	Контекст = Новый Контекст();
	Контекст.ИзСтруктуры(СтруктураИЗ, "Ключ1");

	СтруктураВ = Контекст.ВСтруктуру(, "Ключ2");
	Ожидаем.Что(СтруктураВ.Количество(), "Значения контекста должны быть равны").Равно(1);
	Ожидаем.Что(СтруктураВ.Ключ3, "Значения контекста должны быть равны").Равно(Значение3);


	СтруктураВ = Контекст.ВСтруктуру("Ключ3, Ключ2");
	Ожидаем.Что(СтруктураВ.Количество(), "Значения контекста должны быть равны").Равно(2);
	Ожидаем.Что(СтруктураВ.Ключ3, "Значения контекста должны быть равны").Равно(Значение3);
	Ожидаем.Что(СтруктураВ.Ключ2, "Значения контекста должны быть равны").Равно(Значение2);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьУдалениеИзКонтекста() Экспорт
	
	Значение1 = "Знач1";
	Значение2 = "Знач2";
	Значение3 = "Знач3";

	СтруктураИЗ = Новый Структура("Ключ1, Ключ2, Ключ3", Значение1, Значение2, Значение3);

	Контекст = Новый Контекст();
	Контекст.ИзСтруктуры(СтруктураИЗ);

	Контекст.УдалитьКлючи("Ключ2, Ключ3");

	Ожидаем.Что(Контекст.Количество(), "Значения контекста должны быть равны").Равно(1);
	Ожидаем.Что(Контекст.Из_("Ключ1"), "Значения контекста должны быть равны").Равно(Значение1);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьОчисткуКонтекста() Экспорт
	
	Значение1 = "Знач1";
	Значение2 = "Знач2";
	Значение3 = "Знач3";

	СтруктураИЗ = Новый Структура("Ключ1, Ключ2, Ключ3", Значение1, Значение2, Значение3);

	Контекст = Новый Контекст();
	Контекст.ИзСтруктуры(СтруктураИЗ);

	Контекст.Очистить();

	Ожидаем.Что(Контекст.Количество(), "Значения контекста должны быть равны").Равно(0);
	Ожидаем.Что(Контекст.Из_("Ключ1"), "Значения контекста должны быть равны").Равно(Неопределено);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьПолучениеИУстановкаКонтекста() Экспорт
	
	Значение1 = "Знач1";
	Значение2 = "Знач2";
	Значение3 = "Знач3";

	СтруктураИЗ = Новый Структура("Ключ1, Ключ2, Ключ3", Значение1, Значение2, Значение3);

	Контекст = Новый Контекст();
	Контекст.ИзСтруктуры(СтруктураИЗ);

	Ожидаем.Что(Контекст.Количество(), "Значения контекста должны быть равны").Равно(3);

	Контекст2 = Новый Контекст();
	
	Контекст2.УстановитьКонтекст(Контекст);
	Ожидаем.Что(Контекст2.Количество(), "Значения контекста должны быть равны").Равно(3);

КонецПроцедуры

#КонецОбласти

Лог = Логирование.ПолучитьЛог("oscript.lib.context.testing");



